case16_coarse/cube_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inletOutlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       70456;
    }
    inlet
    {
        type            empty;
        nFaces          5384;
        startFace       70536;
    }
    outlet
    {
        type            empty;
        nFaces          5336;
        startFace       75920;
    }
    Buildings
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          448;
        startFace       81256;
    }
)

// ************************************************************************* //
